tutorials/reactingQGDFoam/1D/Sod/Sod_RR/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch shockTube_Sod_RR.foam
runApplication blockMesh
runApplication setFields
runApplication `getApplication`

#------------------------------------------------------------------------------
