tutorials/reactingQGDFoam/1D/Sod/Sod_RR/constant/reactions
species
(
    O2
    N2
);

reactions
{
}
